tap "felixkratz/formulae"
tap "jackielii/tap"
tap "matt-dong-123/tap", "https://github.com/matt-dong-123/homebrew-tap.git"
tap "mhaeuser/mhaeuser"
tap "morantron/tmux-fingers"
tap "nikitabobko/tap"
tap "sst/tap"
brew "autoconf"
brew "automake"
brew "sqlite"
brew "node"
brew "bash-language-server"
brew "bat"
brew "bob"
brew "btop"
brew "bzip2"
brew "chafa"
brew "cmake"
brew "cmatrix"
brew "cowsay"
brew "python@3.13"
brew "cpplint"
brew "llvm"
brew "curl"
brew "eye-d3"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "glow"
brew "go"
brew "gsl"
brew "gum"
brew "libtool"
brew "imagemagick"
brew "isort"
brew "jdtls"
brew "jq"
brew "kew"
brew "lazygit"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "make"
brew "markdownlint-cli"
brew "marksman"
brew "mp3splt"
brew "ncurses"
brew "neovim"
brew "ouch"
brew "p7zip"
brew "pandoc"
brew "pastel"
brew "pipx"
brew "pnpm"
brew "prettier"
brew "proxychains-ng"
brew "pyright"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "rust-analyzer"
brew "sesh"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "stylua"
brew "taplo"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "uv"
brew "wget"
brew "wtf"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zlib"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "jackielii/tap/skhd-zig"
brew "matt-dong-123/tap/wp"
brew "morantron/tmux-fingers/tmux-fingers"
brew "sst/tap/opencode"
cask "aerospace"
cask "karabiner-elements"
cask "kitty"
cask "ghostty"
