tap "anomalyco/tap"
tap "dimentium/autoraise"
tap "felixkratz/formulae"
tap "jackielii/tap"
tap "matt-dong-123/tap", "https://github.com/matt-dong-123/homebrew-tap.git"
tap "mhaeuser/mhaeuser"
tap "morantron/tmux-fingers"
tap "nikitabobko/tap"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Text-based UI library
brew "ncurses"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Command-line interface for SQLite
brew "sqlite"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Version manager for neovim
brew "bob"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Freely available high-quality data compressor
brew "bzip2"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Next-gen compiler infrastructure
brew "llvm"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Lua Language Server
brew "emmylua_ls"
# Work with ID3 metadata in .mp3 files
brew "eye-d3"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Numerical library for C and C++
brew "gsl"
# Tool for glamorous shell scripts
brew "gum"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Sort Python imports automatically
brew "isort"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Language Server Protocol for Markdown
brew "marksman"
# Command-line interface to split MP3 and Ogg Vorbis files
brew "mp3splt"
# Music Player Daemon
brew "mpd", restart_service: :changed
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Painless compression and decompression for your terminal
brew "ouch"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Hook preloader
brew "proxychains-ng"
# Static type checker for Python
brew "pyright"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal based Media Player Client with album art support
brew "rmpc"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Smart session manager for the terminal
brew "sesh"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# TOML toolkit written in Rust
brew "taplo"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Services for Typst
brew "tinymist"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Markup-based typesetting system
brew "typst"
# Beautiful and reliable typst code formatter
brew "typstyle"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Translate common Internet acronyms
brew "wtf"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey daemon for macOS, written in Zig
brew "jackielii/tap/skhd-zig"
# Get your wifi password, macOS only
brew "matt-dong-123/tap/wp"
# mouseless terminal interaction
brew "morantron/tmux-fingers/tmux-fingers"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Enable Windows-like alt-tab
cask "alt-tab"
# Cloud storage service
cask "baidunetdisk"
# Control the platform power state of your Apple Silicon device
cask "mhaeuser/mhaeuser/battery-toolkit"
# Continuation of Clash Verge - A Clash Meta GUI based on Tauri
cask "clash-verge-rev"
# Web browser
cask "firefox"
cask "font-maple-mono-cn"
cask "font-maple-mono-nf-cn"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Chromium-based web browser
cask "helium-browser"
# Free and open-source media player
cask "iina"
# Tool for multi-language users
cask "input-source-pro"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# System and utility switches
cask "only-switch"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Licenses manager for Steinberg Licensing
cask "steinberg-activation-manager"
# Library manager for Steinberg software
cask "steinberg-library-manager"
# Content manager for Steinberg software
cask "steinberg-mediabay"
# Cloud video conferencing
cask "tencent-meeting"
# Free messaging and calling application
cask "wechat"
# All-in-one office service platform in Chinese
cask "wpsoffice-cn"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
